Documents/АудиторскоеЗаключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АудиторскоеЗаключение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетностиПодлежащиеАудиторскойПроверке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияМненияОДостоверностиОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииМненийОДостоверностиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписанияОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрытиеОтчетностиВИномМесте</Name>
					<Comment>Адрес в сети интернет, либо печатное издание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическоеРаскрытиеИнформации</Name>
					<Comment>Да - фактическое, Нет - плановое</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницаРаскрытияАудиторскогоЗаключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписанты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОРНЗАудитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвалификационногоАттестатаАудитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОРНЗРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвалификационногоАттестатаРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьУполномоченногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУполномочивающегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУполномочивающегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействияПолномочий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПолномочий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОСобытии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОтчетностиПодлежащиеАудиторскойПроверке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОтчетностиПодлежащиеАудиторскойПроверке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГодоваяБухгалтерская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяБухгалтерскаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяКонсолидированнаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяКонсолидированнаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьВОтношенииИмуществаПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяФинансоваяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяФинансоваяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяФинансоваяПоФормированиюИИнвестированиюПН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АудиторскоеЗаключение/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ТипУполномочивающегоДокумента = ?(ЗначениеЗаполнено(Объект.ДоверенностьУполномоченногоЛица), 2, 1);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры
	
#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетностиПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСтандартныйПериодОтчетности(ДатаНачала, ДатаОкончания)
	
	Возврат Документы.АудиторскоеЗаключение.ЭтоСтандартныйПериодОтчетности(ДатаНачала, ДатаОкончания);
	
КонецФункции	

&НаКлиенте
Процедура НачалоПериодаОтчетностиПриИзменении(Элемент)
	
	СтандартныйПериодОтчетности = ЭтоСтандартныйПериодОтчетности(Объект.НачалоПериодаОтчетности, Объект.КонецПериодаОтчетности);
	Объект.ИнформацияОСобытии   = ?(СтандартныйПериодОтчетности, "", Объект.ИнформацияОСобытии);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаОтчетностиПриИзменении(Элемент)

	СтандартныйПериодОтчетности = ЭтоСтандартныйПериодОтчетности(Объект.НачалоПериодаОтчетности, Объект.КонецПериодаОтчетности);
	Объект.ИнформацияОСобытии   = ?(СтандартныйПериодОтчетности, "", Объект.ИнформацияОСобытии);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)

	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
	
	ГКФО = (ДанныеОбъекта.ВидОтчетности = ПредопределенноеЗначение("Перечисление.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяКонсолидированнаяОтчетность")
		ИЛИ ДанныеОбъекта.ВидОтчетности = ПредопределенноеЗначение("Перечисление.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяФинансоваяОтчетность")); 
									
	СопроводительноеПисьмоВXBRL = (Год(ДанныеОбъекта.КонецПериодаОтчетности) >= 2020);
	
	Элементы.СоставОтчетности.Видимость 						= (ГКФО И СопроводительноеПисьмоВXBRL);
	Элементы.ДатаПодписанияОтчетности.Видимость 				= (ГКФО И СопроводительноеПисьмоВXBRL);
	Элементы.СтраницаРаскрытияАудиторскогоЗаключения.Видимость 	= (ГКФО И СопроводительноеПисьмоВXBRL);
	Элементы.РаскрытиеОтчетностиВИномМесте.Видимость 			= (ГКФО И СопроводительноеПисьмоВXBRL);
	Элементы.ФактическоеРаскрытиеИнформации.Видимость 			= (ГКФО И СопроводительноеПисьмоВXBRL);
	
	Элементы.ГруппаУполномочивающийДокумент.Видимость = Форма.ТипУполномочивающегоДокумента = 1;
	Элементы.ГруппаДоверенность.Видимость             = Форма.ТипУполномочивающегоДокумента = 2;
    Элементы.ГруппаРеквизитыДоверенности.Видимость    = ЗначениеЗаполнено(ДанныеОбъекта.ДоверенностьУполномоченногоЛица);

	Элементы.ИнформацияОСобытии.Видимость = Не (ЭтоСтандартныйПериодОтчетности(ДанныеОбъекта.НачалоПериодаОтчетности, 
																				ДанныеОбъекта.КонецПериодаОтчетности));
			
	Элементы.Примечание.Видимость = ДанныеОбъекта.КатегорияМненияОДостоверностиОтчетности 
		<> ПредопределенноеЗначение("Перечисление.КатегорииМненийОДостоверностиОтчетности.НемодифицированноеАудиторскоеЗаключение");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьУполномоченногоЛицаПриИзменении(Элемент)

	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияМненияОДостоверностиОтчетностиПриИзменении(Элемент)
	
	Объект.Примечание = ?(Объект.КатегорияМненияОДостоверностиОтчетности = ПредопределенноеЗначение("Перечисление.КатегорииМненийОДостоверностиОтчетности.НемодифицированноеАудиторскоеЗаключение"),
							Неопределено,
							Объект.Примечание);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТипУполномочивающегоДокументаПриИзменении(Элемент)

	Объект.ДоверенностьУполномоченногоЛица = ?(ЭтаФорма.ТипУполномочивающегоДокумента = 2, Объект.ДоверенностьУполномоченногоЛица, Неопределено);
	Объект.НомерУполномочивающегоДокумента = ?(ЭтаФорма.ТипУполномочивающегоДокумента = 2, Неопределено, Объект.НомерУполномочивающегоДокумента); 
	Объект.ДатаУполномочивающегоДокумента  = ?(ЭтаФорма.ТипУполномочивающегоДокумента = 2, Неопределено, Объект.ДатаУполномочивающегоДокумента); 
	Объект.ДатаНачалаДействияПолномочий    = ?(ЭтаФорма.ТипУполномочивающегоДокумента = 2, Неопределено, Объект.ДатаНачалаДействияПолномочий); 
	Объект.ДатаОкончанияДействияПолномочий = ?(ЭтаФорма.ТипУполномочивающегоДокумента = 2, Неопределено, Объект.ДатаОкончанияДействияПолномочий); 
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры
	
#КонецОбласти
